# GetHookExtensionLength Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHookType..::..GetHookExtensionLength Method
RebarHookType Class See Also
---
Computes the hook extension length based on current hook length
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GetHookExtensionLength(
	RebarBarType barType
)
```

Visual Basic
---
```text
Public Function GetHookExtensionLength ( _
	barType As RebarBarType _
) As Double
```

Visual C++
---
```text
public:
double GetHookExtensionLength(
	RebarBarType^ barType
)
```

# ### Parameters
barType
    Type: Autodesk.Revit.DB.Structure..::..RebarBarType
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace